pd0wm/simple-sdr/firmware/sdr_board.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
ProjectManager.MainLocation=Src
RCC.MCOFreq_Value=48000000
RCC.I2SFreq_Value=48000000
RCC.USART1Freq_Value=48000000
ProjectManager.ProjectFileName=sdr_board.ioc
PA7.Mode=Output Compare1 CH1N
ProjectManager.TemplateDestinationPath=/home/willem/Desktop/sdr/sdr_board
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F042G6Ux
Mcu.PinsNb=8
ProjectManager.NoMain=false
TIM1.IPParameters=Channel-Output Compare2 CH2N,Channel-Output Compare1 CH1N,Prescaler,Pulse-Output Compare1 CH1N,Period,ClockDivision,Pulse-Output Compare2 CH2N,OC2Preload,OC1Preload,OCMode_1,OCMode_2,BreakState,AutomaticOutput,OCNIdleState_1,OCNIdleState_2,OCNPolarity_2,OCNPolarity_1,LockLevel
RCC.PLLCLKFreq_Value=48000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC_Init-ADC-false-HAL-true,4-MX_TIM1_Init-TIM1-false-HAL-true
TIM1.OCMode_2=TIM_OCMODE_TOGGLE
ProjectManager.UseDefaultSourcePath=true
TIM1.OCMode_1=TIM_OCMODE_TOGGLE
TIM2.Channel-Output\ Compare3\ CH3=TIM_CHANNEL_3
TIM1.OC2Preload=DISABLE
ProjectManager.DefaultFWLocation=true
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
ProjectManager.TemplateSourcePath=/home/willem/STM32CubeMX/db/extra_templates
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
TIM1.ClockDivision=TIM_CLOCKDIVISION_DIV1
PB0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Mcu.IP4=TIM1
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP5=TIM2
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=ADC
Mcu.IP1=NVIC
TIM1.Prescaler=22
TIM1.Channel-Output\ Compare1\ CH1N=TIM_CHANNEL_1
Mcu.UserConstants=
TIM1.Pulse-Output\ Compare1\ CH1N=0
ProjectManager.TargetToolchain=Other Toolchains (GPDSC)
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=48000000
Mcu.IPNb=6
TIM2.IPParameters=Channel-Output Compare3 CH3,OCMode_3,Prescaler,Period,Pulse-Output Compare3 CH3,ClockDivision
ProjectManager.PreviousToolchain=
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
TIM1.AutomaticOutput=TIM_AUTOMATICOUTPUT_DISABLE
TIM2.ClockDivision=TIM_CLOCKDIVISION_DIV4
Mcu.Pin6=VP_TIM1_VS_ClockSourceINT
Mcu.Pin7=VP_TIM2_VS_ClockSourceINT
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
TIM1.OC1Preload=DISABLE
PA1.Signal=ADC_IN1
RCC.AHBFreq_Value=48000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
GPIO.groupedBy=
Mcu.Pin2=PA2
Mcu.Pin3=PA7
Mcu.Pin4=PB0
Mcu.Pin5=VP_SYS_VS_Systick
ProjectManager.ProjectBuild=false
PA0.Locked=true
PB0.Mode=Output Compare2 CH2N
board=custom
TIM1.LockLevel=TIM_LOCKLEVEL_OFF
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TIM1.OCNPolarity_1=TIM_OCNPOLARITY_HIGH
ProjectManager.LastFirmware=true
RCC.PLLMUL=RCC_PLL_MUL6
PA7.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
TIM1.OCNIdleState_2=TIM_OCNIDLESTATE_RESET
TIM1.OCNIdleState_1=TIM_OCNIDLESTATE_RESET
RCC.VCOOutput2Freq_Value=8000000
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.0
MxDb.Version=DB.5.0.60
PB0.GPIOParameters=GPIO_Speed
PA1.Mode=IN1
TIM1.OCNPolarity_2=TIM_OCNPOLARITY_HIGH
ProjectManager.BackupPrevious=false
MxCube.Version=5.6.1
VP_TIM2_VS_ClockSourceINT.Mode=Internal
SH.S_TIM2_CH3.0=TIM2_CH3,Output Compare3 CH3
TIM2.Pulse-Output\ Compare3\ CH3=500
File.Version=6
PA0.Mode=IN0
VP_SYS_VS_Systick.Mode=SysTick
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM2_CH3.ConfNb=1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Period=1000
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,CECFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSICECFreq_Value,I2SFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F042G(4-6)Ux
ProjectManager.HalAssertFull=false
PB0.Locked=true
VP_TIM1_VS_ClockSourceINT.Mode=Internal
PA2.Signal=S_TIM2_CH3
ProjectManager.ProjectName=sdr_board
ProjectManager.UnderRoot=false
PA0.Signal=ADC_IN0
RCC.HSICECFreq_Value=32786.88524590164
RCC.PLLMCOFreq_Value=48000000
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=48000000
Mcu.Package=UFQFPN28
TIM2.Prescaler=10000
RCC.TimSysFreq_Value=48000000
TIM2.OCMode_3=TIM_OCMODE_TOGGLE
PA1.Locked=true
PA7.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.ComputerToolchain=false
ProjectManager.UseDefaultDestinationPath=true
TIM1.BreakState=TIM_BREAK_DISABLE
RCC.CECFreq_Value=32786.88524590164
RCC.APB1TimFreq_Value=48000000
TIM1.Period=1
TIM1.Channel-Output\ Compare2\ CH2N=TIM_CHANNEL_2
RCC.APB1Freq_Value=48000000
PB0.Signal=TIM1_CH2N
PA7.GPIOParameters=GPIO_Speed
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F042G6Ux
TIM1.Pulse-Output\ Compare2\ CH2N=1
ProjectManager.LibraryCopy=2
PA7.Signal=TIM1_CH1N
PA2.Locked=true
